class Helper(object):
    HELP_M = '''دسته مورد نظر خود را برای دریافت راهنمایی انتخاب کنید.
سوالات خود را در گروه پشتیبانی مطرح کنید

تمام دستورات با / قابل استفاده هستند'''

    HELP_ChatGPT = '''چت جی‌پی‌تی

دستورات چت جی‌پی‌تی:

/ask ➠ از مدل هوش مصنوعی سوال بپرسید و پاسخ دریافت کنید.
'''

    HELP_Sticker = '''استیکرها 

دستورات استیکر:

/packkang ➠ از پک استیکر دیگری یک پک جدید می‌سازد.
/stickerid ➠ شناسه استیکر را نمایش می‌دهد.
'''

    HELP_TagAll = '''تگ کردن

دستورات تگ:

✿ نوع تگ را در گروه خود انتخاب کنید ✿

๏ /gmtag ➛ تگ صبح بخیر
برای توقف ⇴ /gmstop

๏ /gntag ➛ تگ شب بخیر
برای توقف ⇴ /gnstop 

๏ /tagall ➛ تگ با پیام تصادفی
برای توقف ⇴ /tagoff /tagstop

๏ /hitag ➛ تگ با پیام تصادفی فارسی
برای توقف ⇴ /histop

๏ /shayari ➛ تگ با شعر تصادفی 
برای توقف ⇴ /shstop

๏ /utag ➛ تگ با متن دلخواه
برای توقف ⇴ /cancel

๏ /vctag ➛ تگ دعوت به چت صوتی
برای توقف ⇴ /vcstop
'''

    HELP_Info = '''اطلاعات

دستورات اطلاعات:

/id : دریافت شناسه گروه فعلی. اگر در پاسخ به پیامی استفاده شود، شناسه آن کاربر را نمایش می‌دهد.
/info : دریافت اطلاعات کاربر.
/github <نام کاربری> : دریافت اطلاعات کاربر گیت‌هاب.
'''

    HELP_Group = '''مدیریت گروه

دستورات مدیریت گروه:

دستورات مدیریتی موجود:

⦿ /pin ➠ سنجاق کردن پیام در گروه.
⦿ /pinned ➠ نمایش پیام سنجاق شده در گروه.
⦿ /unpin ➠ برداشتن سنجاق پیام فعلی.
⦿ /staff ➠ نمایش لیست مدیران.
⦿ /bots ➠ نمایش لیست ربات‌های گروه.
⦿ /settitle ➠ تنظیم عنوان گروه.
⦿ /setdiscription ➠ تنظیم توضیحات گروه.
⦿ /setphoto ➠ تنظیم تصویر گروه.
⦿ /removephoto ➠ حذف تصویر گروه.
⦿ /zombies ➠ حذف حساب‌های حذف شده از گروه.
⦿ /imposter on/off ➠ روشن/خاموش کردن ناظر گروه که تغییرات نام و نام کاربری را اطلاع می‌دهد.
'''

    HELP_Extra = '''امکانات اضافی

دستورات اضافی:

⦿ /math ➠ حل مسائل و معادلات ریاضی.
⦿ /blackpink ➠ ایجاد لوگو به سبک بلک‌پینک.
⦿ /carbon ➠ ایجاد تصویر کد کربن از قطعه کد.
⦿ /speedtest ➠ اندازه‌گیری سرعت اینترنت.
⦿ /reverse ➠ معکوس کردن متن.
⦿ /webss ➠ گرفتن اسکرین‌شات از وبسایت.
⦿ /paste ➠ آپلود متن در فضای ابری و دریافت لینک.
⦿ /tgm ➠ آپلود عکس (زیر ۵ مگابایت) در فضای ابری و دریافت لینک.
⦿ /tr ➠ ترجمه متن.
⦿ /google ➠ جستجو در گوگل.
⦿ /stack ➠ جستجوی اطلاعات برنامه‌نویسی در استک اورفلو.
'''

    HELP_Image = '''تصاویر

دستورات تصویر:

⦿ /draw ➠ ایجاد نقاشی بر اساس توضیحات.
⦿ /image ➠ جستجوی تصویر بر اساس کلمه کلیدی.
⦿ /upscale ➠ پاسخ به تصویر برای افزایش کیفیت آن.
'''

    HELP_Action = '''اقدامات مدیریتی

دستورات مدیریتی:

» دستورات موجود برای بن و میوت:

 ❍ /kickme: اخراج کاربری که دستور را صادر کرده

فقط برای ادمین‌ها:
 ❍ /ban <نام کاربری>: بن کردن کاربر (با نام کاربری یا پاسخ)
 ❍ /sban <نام کاربری>: بن بی‌صدا. دستور و پیام پاسخ را حذف می‌کند (با نام کاربری یا پاسخ)
 ❍ /tban <نام کاربری> x(m/h/d): بن موقت کاربر. m = دقیقه، h = ساعت، d = روز
 ❍ /unban <نام کاربری>: رفع بن کاربر
 ❍ /kick <نام کاربری>: اخراج کاربر از گروه
 ❍ /mute <نام کاربری>: میوت کردن کاربر
 ❍ /tmute <نام کاربری> x(m/h/d): میوت موقت کاربر
 ❍ /unmute <نام کاربری>: رفع میوت کاربر

دستورات ویژه از همه فرمت‌ها پشتیبانی می‌کنند - مثال: یومی بن، یومی میوت، یومی ارتقا و...
'''

    HELP_Search = '''جستجو

دستورات جستجو:

• /google <عبارت> : جستجو در گوگل
• /anime <عبارت> : جستجو در myanimelist
• /stack <عبارت> : جستجو در استک اورفلو
• /image (/imgs) <عبارت> : دریافت تصاویر مرتبط

مثال:
/google pyrogram: نمایش ۵ نتیجه برتر
'''

    HELP_Font = '''فونت‌ها

راهنمای ماژول فونت:

با استفاده از این ماژول می‌توانید فونت هر متنی را تغییر دهید!

◌ /font [متن]
'''

    HELP_Game = '''بازی‌ها

راهنمای ماژول بازی‌ها:

مینی گیم‌هایی برای سرگرمی شما!

◌ /toss [پرتاب سکه]
◌ /roll [پرتاب تاس]
◌ /dart [پرتاب دارت]
◌ /slot [ماشین جکپات]
◌ /bowling [بازی بولینگ]
◌ /basket [بازی بسکتبال]
◌ /football [بازی فوتبال]
'''

    HELP_TG = '''تلگراف

دستورات تلگراف:

ایجاد لینک تلگراف برای هر رسانه!

◌ /tgm [پاسخ به رسانه]
◌ /tgt [پاسخ به رسانه]
'''

    HELP_Imposter = '''ناظر تغییرات

راهنمای ماژول ناظر:

◌ /imposter on
◌ /imposter off
'''

    HELP_TD = '''جرأت یا حقیقت

راهنمای ماژول جرأت یا حقیقت:

◌ /truth : ارسال یک سوال حقیقت تصادفی
◌ /dare : ارسال یک جرأت تصادفی
'''

    HELP_HT = '''هشتگ

راهنمای ماژول هشتگ:

◌ /hastag : [متن]
'''

    HELP_TTS = '''تبدیل متن به گفتار

راهنمای ماژول تبدیل متن به گفتار:

❀ تبدیل متن به گفتار
◌ /tts : [متن]

◌ کاربرد ➛ تبدیل متن به فایل صوتی
'''

    HELP_Fun = '''سرگرمی

راهنمای ماژول سرگرمی:

ماژول آرزو:
◌ /wish : آرزوی خود را اضافه کنید و احتمال تحقق آن را ببینید!

امکانات بیشتر:
◌ /sigma [بررسی میزان سیگما بودن شما]
◌ /cute [بررسی میزان بامزه بودن شما]
◌ /horny [بررسی میزان هورنی بودن شما]
◌ /lesbo [بررسی میزان لزبین بودن شما]
◌ /depressed [بررسی میزان افسردگی شما]
◌ /gay [بررسی میزان گی بودن شما]
◌ /rand [بررسی میزان رند بودن شما]
◌ /bkl [بررسی میزان bkl بودن شما]
◌ /boobs [بررسی سایز سینه شما]
◌ /dick [بررسی سایز آلت شما]
'''

    HELP_Q = '''نقل قول

راهنمای ماژول نقل قول:

◌ /q : ایجاد نقل قول از پیام

◌ /q r : ایجاد نقل قول از پیام با پاسخ
'''

    fullpromote = {
        'can_change_info': True,
        'can_post_messages': True,
        'can_edit_messages': True,
        'can_delete_messages': True,
        'can_invite_users': True,
        'can_restrict_members': True,
        'can_pin_messages': True,
        'can_promote_members': True,
        'can_manage_chat': True,
    }

    promoteuser = {
        'can_change_info': False,
        'can_post_messages': True,
        'can_edit_messages': True,
        'can_delete_messages': False,
        'can_invite_users': True,
        'can_restrict_members': False,
        'can_pin_messages': False,
        'can_promote_members': False,
        'can_manage_chat': True,
    }
