HELP_1 = """<b><u>أوامر المشرف:</b></u>

فقط أضف <b>c</b> في بداية الأوامر لاستخدامها في القناة.

/pause : إيقاف البث الحالي مؤقتاً.
/resume : استئناف البث المتوقف.
/skip : تخطي البث الحالي وبدء تشغيل المسار التالي في قائمة الانتظار.
/end أو /stop : مسح قائمة الانتظار وإنهاء البث الحالي.
/player : الحصول على لوحة تشغيل تفاعلية.
/queue : عرض قائمة المسارات في الانتظار.
"""

HELP_2 = """
<b><u>المستخدمون المعتمدون:</b></u>

يمكن للمستخدمين المعتمدين استخدام صلاحيات المشرف في البوت دون أن يكونوا مشرفين في المحادثة.

/auth [اسم المستخدم/معرف المستخدم] : إضافة مستخدم إلى قائمة المعتمدين.
/unauth [اسم المستخدم/معرف المستخدم] : إزالة مستخدم من قائمة المعتمدين.
/authusers : عرض قائمة المستخدمين المعتمدين في المجموعة.
"""

HELP_3 = """
<u><b>ميزة البث</b></u> [للمطورين فقط]:

/broadcast [رسالة أو رد على رسالة] : بث رسالة إلى المحادثات المخدومة للبوت.

<u>أوضاع البث:</u>
<b>-pin</b> : تثبيت رسالتك المبثوثة في المحادثات المخدومة.
<b>-pinloud</b> : تثبيت رسالتك المبثوثة وإرسال إشعار للأعضاء.
<b>-user</b> : بث الرسالة للمستخدمين الذين بدأوا البوت.
<b>-assistant</b> : بث رسالتك من حساب المساعد للبوت.
<b>-nobot</b> : إجبار البوت على عدم بث الرسالة.

<b>مثال:</b> <code>/broadcast -user -assistant -pin اختبار البث</code>
"""

HELP_4 = """<u><b>ميزة القائمة السوداء للمحادثات:</b></u> [للمطورين فقط]

منع المحادثات السيئة من استخدام البوت.

/blacklistchat [معرف المحادثة] : إضافة محادثة للقائمة السوداء.
/whitelistchat [معرف المحادثة] : إزالة محادثة من القائمة السوداء.
/blacklistedchat : عرض قائمة المحادثات المدرجة في القائمة السوداء.
"""

HELP_5 = """
<u><b>حظر المستخدمين:</b></u> [للمطورين فقط]

يبدأ في تجاهل المستخدم المحظور، بحيث لا يمكنه استخدام أوامر البوت.

/block [اسم المستخدم أو الرد على مستخدم] : حظر المستخدم من استخدام البوت.
/unblock [اسم المستخدم أو الرد على مستخدم] : إلغاء حظر المستخدم المحظور.
/blockedusers : عرض قائمة المستخدمين المحظورين.
"""

HELP_6 = """
<u><b>أوامر تشغيل القناة:</b></u>

يمكنك بث الصوت/الفيديو في القناة.

/cplay : بدء تشغيل المسار الصوتي المطلوب في دردشة الفيديو للقناة.
/cvplay : بدء تشغيل مسار الفيديو المطلوب في دردشة الفيديو للقناة.
/cplayforce أو /cvplayforce : إيقاف البث الحالي وبدء تشغيل المسار المطلوب.

/channelplay [اسم مستخدم القناة أو معرفها] أو [تعطيل] : ربط القناة بمجموعة وبدء تشغيل المسارات باستخدام الأوامر المرسلة في المجموعة.
"""

HELP_7 = """
<u><b>ميزة الحظر العالمي</b></u> [للمطورين فقط]:

/gban [اسم المستخدم أو الرد على مستخدم] : حظر المستخدم عالمياً من جميع المحادثات المخدومة ومنعه من استخدام البوت.
/ungban [اسم المستخدم أو الرد على مستخدم] : إلغاء الحظر العالمي للمستخدم المحظور.
/gbannedusers : عرض قائمة المستخدمين المحظورين عالمياً.
"""

HELP_8 = """
<b><u>تكرار البث:</b></u>

<b>يبدأ في تكرار البث الحالي في حلقة</b>

/loop [تفعيل/تعطيل] : تفعيل/تعطيل التكرار للبث الحالي
/loop [1, 2, 3, ...] : تفعيل التكرار للقيمة المحددة.
"""

HELP_9 = """
<u><b>وضع الصيانة</b></u> [للمطورين فقط]:

/logs : الحصول على سجلات البوت.
/logger [تفعيل/تعطيل] : سيبدأ البوت في تسجيل الأنشطة التي تحدث.
/maintenance [تفعيل/تعطيل] : تفعيل أو تعطيل وضع الصيانة للبوت.
"""

HELP_10 = """
<b><u>البينج والإحصائيات:</b></u>

/start : بدء تشغيل بوت الموسيقى.
/help : الحصول على قائمة المساعدة مع شرح الأوامر.
/ping : عرض البينج وإحصائيات النظام للبوت.
/stats : عرض الإحصائيات الكاملة للبوت.
"""

HELP_11 = """
<u><b>أوامر التشغيل:</b></u>

<b>v:</b> للتشغيل بالفيديو.
<b>force:</b> للتشغيل الإجباري.

/play أو /vplay : بدء تشغيل المسار المطلوب في دردشة الفيديو.
/playforce أو /vplayforce : إيقاف البث الحالي وبدء تشغيل المسار المطلوب.
"""

HELP_12 = """
<b><u>خلط قائمة الانتظار:</b></u>

/shuffle : خلط المسارات في قائمة الانتظار.
/queue : عرض قائمة الانتظار المخلوطة.
"""

HELP_13 = """
<b><u>تقديم وترجيع البث:</b></u>

/seek [المدة بالثواني] : تقديم البث إلى المدة المحددة.
/seekback [المدة بالثواني] : ترجيع البث إلى المدة المحددة.
"""

HELP_14 = """
<b><u>تحميل الأغاني</b></u>

/song [اسم الأغنية/رابط يوتيوب] : تحميل أي مسار من يوتيوب بصيغة MP3 أو MP4.
"""

HELP_15 = """
<b><u>أوامر السرعة:</b></u>

يمكنك التحكم في سرعة تشغيل البث الحالي. [للمشرفين فقط]

/speed أو /playback : لضبط سرعة تشغيل الصوت في المجموعة.
/cspeed أو /cplayback : لضبط سرعة تشغيل الصوت في القناة.
"""
